| Version | Published Date| Details |
| -- | -- | -- |
| ver.1.0.0 | 2024/02/14 | 初版リリース |

**↓必ず最初にセットアップ用のセルを実行し、完了（セルの左端にチェックマーク）してから取り組んでください。**

In [1]:
!git clone https://github.com/TechBowl-japan/SQLRailway-setup.git
!sudo sh ./SQLRailway-setup/setup.sh
%load_ext sql
%sql mysql+pymysql://root:root@localhost:3306/sql_railway

Cloning into 'SQLRailway-setup'...
remote: Enumerating objects: 66, done.
remote: Counting objects: 100% (66/66), done.
remote: Compressing objects: 100% (39/39), done.
remote: Total 66 (delta 25), reused 60 (delta 19), pack-reused 0
Receiving objects: 100% (66/66), 20.18 KiB | 6.73 MiB/s, done.
Resolving deltas: 100% (25/25), done.

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.


WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78, <> line 25.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
su: warning: cannot change directory to /nonexistent: No such file or directory
mysql: [Warning] Using a password on the command line interface can be insecure.
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.4 MB/s eta 0:00:00

# 簡単な条件検索をしてみよう

station1では基本のSELECT文を使いました。

```sql
SELECT * FROM users;
```

このSELECT文はstation1で実行したusersテーブルに登録されているレコードを全て取り出すクエリです。

テーブルに登録されているすべてのデータではなく、idが「1」のレコードのみを取得したい場合はどうやって取得するのでしょうか。

このstationではこのような簡単な条件を指定して取り出し方について学びましょう。

## WHERE句と比較演算子

条件を指定するには`WHERE` 句を使用します。まずは次のセルを実行してみましょう。

In [2]:
%sql SELECT id, name FROM users WHERE id = 1;

 * mysql+pymysql://root:***@localhost:3306/sql_railway
1 rows affected.

[(1, '田中 花子')]

idが「1」のレコードが1件出力されていれば成功です。

このクエリには先頭から`SELECT id, name` 、これはstation1でやった通りidとnameを取り出すことを指定しています。

次に`FROM users` これも同じくstation1でやったのと同じでusersというテーブルを指定しています。

最後に`WHERE id = 1` とあります。

これはidが1ということを指定しています。

つまりこのクエリはuserテーブルのidが1のレコードのidとnameを取り出すクエリになります。


### 比較演算子

`id = 1` の`=` は__比較演算子__と呼ばれるものです。

比較演算子には`=` 以外にもいくつかあります。それぞれ下記のような意味を持ちます。

| 比較演算子 | 意味 |
| --- | --- |
| A = B | AとBが等しい |
| A > B | AがBより大きい |
| A < B | AがBより小さい |
| A >= B | AがB以上 |
| A <= B | AがB以下 |
| A <> B or A != B | AとBが等しくない |

例えば`WHERE id != 1` とした場合はidが1でないものを指定します。

他にも`BETWEEN` や`IN` などありますが、次のstationで取り扱います。

## AND, OR

### AND
WHEREを使うことでクエリに条件を追加できることがわかりました。

では、「男性かつ年齢が40歳のユーザーを取り出したい」など条件が複数あるケースはどうでしょう。

`WHERE 条件式` に続けて`AND 条件式` とすることで実現できます。

まずは次のセルを実行しましょう。

In [3]:
%sql SELECT id, name, gender, age FROM users WHERE gender = '男' AND age = 40;

 * mysql+pymysql://root:***@localhost:3306/sql_railway
1 rows affected.

[(38, '杉山 勇輝', '男', 40)]

性別が男性かつ年齢が40歳のレコードが出力されていれば成功です。

このように`AND` で条件をつなげて記述することで複数の条件を満たすレコードを取り出すことができます。

### OR

`OR` を使うと「性別が男性、または年齢が40歳のユーザーを取り出したい」などのいずれかの条件に当てはまるレコードを取り出すことができます。

まずは次のセルを実行してみましょう。

In [4]:
%sql SELECT id, name, gender, age FROM users WHERE gender = '男' OR age = 40;

 * mysql+pymysql://root:***@localhost:3306/sql_railway
40 rows affected.

[(2, '山田 太郎', '男', 32),
 (3, '鈴木 一郎', '男', 34),
 (5, '小林 健太', '男', 42),
 (7, '中村 健司', '男', 39),
 (9, '高橋 啓介', '男', 45),
 (11, '田村 裕太', '男', 29),
 (12, '岡田 佳子', '女', 40),
 (14, '伊藤 勇太', '男', 36),
 (16, '古川 健太郎', '男', 47),
 (18, '野口 裕太', '男', 33),
 (20, '三浦 健太', '男', 41),
 (22, '斉藤 太一', '男', 43),
 (24, '西田 和彦', '男', 38),
 (26, '吉岡 修', '男', 44),
 (28, '岩崎 大輔', '男', 42),
 (30, '高田 勇也', '男', 35),
 (32, '宮崎 隆', '男', 39),
 (34, '森田 裕太', '男', 46),
 (36, '神田 健一', '男', 36),
 (38, '杉山 勇輝', '男', 40),
 (40, '服部 剛', '男', 32),
 (42, '中田 裕介', '男', 25),
 (44, '高野 大輔', '男', 38),
 (46, '清水 賢太', '男', 45),
 (48, '宮本 啓太', '男', 41),
 (50, '新井 健太', '男', 26),
 (52, '山田 太郎', '男', 102),
 (53, '鈴木 一郎', '男', 11),
 (56, '中村 健司', '男', 92),
 (58, '高橋 啓介', '男', 7),
 (60, '田村 裕太', '男', 4),
 (63, '田中 太郎', '男', 12),
 (66, '谷田部 悠太', '男', 22),
 (68, '田村 太郎', '男', 21),
 (69, '吉田 一郎', '男', 11),
 (71, '高橋 健太', '男', 21),
 (73, '鈴木 健司', '男', 32),
 (75, '小林 啓介', '男', 11),
 (77, '岡田 裕太', '男', 21),
 (80, '山田 勇太', '男', 21)]

出力されたレコードが性別が男性または年齢が40歳のいずれかを満たしていれば成功です。

先ほどの`AND` を使ったクエリでは両方の条件を満たしたものだけでしたが、このように`OR` を使うといずれかの条件を満たすものを取り出すことができます。

# 確認テスト

(1)usersテーブルから女性かつ年齢が90歳以上のユーザーを取り出したデータの数を入力してください。

In [7]:
%%sql SELECT gender, age FROM users WHERE gender = "女" AND age >= 90

 * mysql+pymysql://root:***@localhost:3306/sql_railway
3 rows affected.

[('女', 90), ('女', 92), ('女', 93)]

(2)usersテーブルから年齢が10歳未満または90歳以上のユーザーを取り出した時のデータの数を入力してください。

In [10]:
%%sql SELECT age FROM users WHERE age < 10 OR age >= 90

 * mysql+pymysql://root:***@localhost:3306/sql_railway
10 rows affected.

[(4,), (102,), (0,), (2,), (92,), (90,), (7,), (92,), (4,), (93,)]